# ณ เมืองแห่งหนึ่ง ที่มีชื่อว่า ... อืม (เอ้าผู้แต่งโจทย์คิดชื่อไม่ออก เอาเป็นว่าไม่ต้องสนใจก็ได้) จะมีบริการคมนาคมสาธารณะ 
# ซึ่งเป็นสิ่งที่น้อง ๆ พี่ ๆ อาจารย์ ๆ หรือ บุคคลอื่น ๆ ที่อาจจะคุณเคยกันหรือเคยนั้งก็มานั้นก็คือ "รถไฟฟ้า" นั้นเอง โดยแต่ละเมือง 
# จะเปรียบเหมือน Node ของ Linked List นั้นเอง ซึ่งรถไฟฟ้าจะมีทั้งขาไปขากลับนั้นเอง และ รถไฟฟ้าขาไป 
# ผ่านสถานีสุดท้ายของทางรถไฟฟ้าจะวนกลับมาสถานีแรก หรือในทางกลับกัน รถไฟฟ้าขากลับผ่านสถานีแรกก็จะวนกลับไปสถานีสุดท้ายเช่นกัน 
# เพื่อให้ "พี่โบ๊ท" ที่เป็นชาวเมืองนี้มีรถไฟฟ้านั้นไปทำงานหรือท่องเทียวในเมืองนี้ได้สะดวกขึ้น ต่อไปก็เป็นหน้าที่ของน้อง ๆ แล้วล่ะ 
# ที่จะสานฝันให้เมืองนี้และ "พี่โบ๊ท" มี ระบบรถไฟฟ้าที่ "สมบูรณ์แบบ" ที่สร้างขึ้นมาจากน้ำมือของน้องเองๆ 

# input จะเป็น
# บรรทัดแรก จะเป็น list ของ ชื่อสถาณี
# บรรทัดสอง จะเป็น สถานีต้นทาง,สถานีปลายทาง,ทิศทางของรถไฟฟ้า(ถ้าไม่ใส่ให้แสดงผลในขาที่ระยะทางสั้นที่สุด ถ้าเกิดเท่ากัน ให้แสดงผลลัพธ์ทั้งขาไปและขากลับ)
# โดย F จะเป็น รถไฟฟ้าขาไป
#   B จะเป็น รถไฟฟ้าขากลับ
# output จะเป็น
# แสดงการเดินทางของรถไฟฟ้า,จำนวนสถานีที่จะถึงปลายทาง